# Groupby in Pandas Dataframe

The Tutorial Covers one of the most frequent used function in performing Data Analysis.

Groupby in pandas can be accomplished by groupby() function. Groupby of single and multiple column can be accomplised by multiple ways some of them are aggregate function and groupby() function.

1. Groupby Single Column.<br>
    1.1 Groupby Single Column using reset_index()
2. Groupby multiple column.<br>
    2.1 Groupby multiple column using reset_index()
3. Groupby using aggregate function.<br>
    3.1 Groupby aggregate function using reset_index()

### Lets Create the DataFrame

In [5]:
import pandas as pd
import numpy as np
import random

#Create a dataframe
raw_data = {'first_name': ['Sam','Ziva','Kia','Robin','Kim','Ram','Zen','John','Ariel','Ron'], 
         'degree': ['PhD','MBA','PhD','MS','MBA','PhD','PhD','MS','PhD','PhD'],
         'nationality': ['USA','India','India','USA','India','UK','USA','USA','India','UK'],
         'age': [25, 29, 19, 21, 33, 38, 24, 26, 32, 29]}
df = pd.DataFrame(raw_data)

#Randomly generate Salary between 80K to 150K having steps (multiple) of 10K
df['salary']=0
df['salary']=df['salary'].apply(lambda x: random.randrange(80000,150000,10000))
 
df

  first_name degree nationality  age  salary
0        Sam    PhD         USA   25   80000
1       Ziva    MBA       India   29  110000
2        Kia    PhD       India   19  110000
3      Robin     MS         USA   21  100000
4        Kim    MBA       India   33   80000
5        Ram    PhD          UK   38  100000
6        Zen    PhD         USA   24  120000
7       John     MS         USA   26   80000
8      Ariel    PhD       India   32   80000
9        Ron    PhD          UK   29   80000

### 1. Groupby Single Column

groupby() function takes up the column name as argument followed by function as shown below

In [7]:
''' Groupby single column in pandas python '''
df.groupby(['degree'])['salary'].sum()

degree
MBA    190000
MS     180000
PhD    570000
Name: salary, dtype: int64

#### Using reset_index
reset_index() function resets and provides the new index to the grouped by dataframe and makes them a proper dataframe structure

In [9]:
df.groupby(['degree'])['salary'].sum().reset_index()

  degree  salary
0    MBA  190000
1     MS  180000
2    PhD  570000

### 2. Groupby multiple columns

We will group degree and nationality so the results will be

In [10]:
df.groupby(['degree','nationality'])['salary'].sum()

degree  nationality
MBA     India          190000
MS      USA            180000
PhD     India          190000
        UK             180000
        USA            200000
Name: salary, dtype: int64

#### Groupby multiple columns in pandas using  reset_index()

We will groupby sum with “degree” and “nationality” columns along with the reset_index() will give a proper table structure , so the result will be

In [11]:
df.groupby(['degree','nationality'])['salary'].sum().reset_index()

  degree nationality  salary
0    MBA       India  190000
1     MS         USA  180000
2    PhD       India  190000
3    PhD          UK  180000
4    PhD         USA  200000

### 3. Groupby using aggreagate function
agg() function takes function as input which performs groupby on function, reset_index() assigns the new index to the grouped by dataframe and makes them a proper dataframe structure

In [12]:
#groupby on nationality & degree, taking max of age and summation of salary per group
df.groupby(
   ['nationality','degree']
).agg(
    {
         'salary':"sum",    # sum of salary per group
         'age': "max"  # max of age per group
    }
).reset_index()

  nationality degree  salary  age
0       India    MBA  190000   33
1       India    PhD  190000   32
2          UK    PhD  180000   38
3         USA     MS  180000   26
4         USA    PhD  200000   25

We will compute groupby sum using agg() function with “nationality” and “degree” columns along with the reset_index() will give a proper table structure , so the result will be